<?php

return [

    /*
    |--------------------------------------------------------------------------
    | رسائل التحقق من الصحة
    |--------------------------------------------------------------------------
    |
    | السطور التالية تحتوي على الرسائل الافتراضية المستخدمة من قبل
    | فئة المدقق. بعض هذه القواعد لها إصدارات متعددة مثل
    | قواعد الحجم. لا تتردد في تعديل كل من هذه الرسائل هنا.
    |
    */

    'required' => 'حقل :attribute مطلوب.',
    'string' => 'حقل :attribute يجب أن يكون نصاً.',
    'email' => 'حقل :attribute يجب أن يكون عنوان بريد إلكتروني صالح.',
    'unique' => 'قيمة :attribute مُستخدمة من قبل.',
    'confirmed' => 'حقل تأكيد :attribute غير متطابق.',
    'min' => [
        'string' => 'يجب أن يحتوي :attribute على 8 أحرف على الأقل.',
    ],
    'max' => [
        'string' => 'يجب ألا يتجاوز :attribute :max حرفًا.',
    ],

    /*
    |--------------------------------------------------------------------------
    | أسماء السمات المخصصة
    |--------------------------------------------------------------------------
    |
    | لنجعل رسائلنا أكثر تعبيراً. هنا يمكنك تحديد "أسماء سمات"
    | مخصصة ليتم استخدامها بدلاً من اسم السمة الفعلي.
    |
    */

    'attributes' => [
        'name' => 'الاسم',
        'email' => 'البريد الإلكتروني',
        'phone' => 'رقم الهاتف',
        'password' => 'كلمة المرور',
        'new_password' => 'كلمة المرور الجديدة',
    ],

];